# Generated file, please do not edit.
# Use the Pollux tool instead.
$AuditCategory.Activity.label=Mod\u00E8le d'activit\u00E9
$AuditCategory.Others.label=Autres
$AuditCategory.Sequence.label=Mod\u00E8le de s\u00E9quence
$AuditCategory.State.label=Mod\u00E8le d'\u00E9tat
$AuditCategory.Static.label=Mod\u00E8le statique
$AuditCategory.UseCase.label=Mod\u00E8le de cas d'utilisation
$R1000.description=Un Model Element ne peut pas s'abstraire lui-m\u00EAme.
$R1000.message=''{2}'' ({3}) ne peut pas s''abstraire lui-m\u00EAme.
$R1010.description=Les Partitions racines d'une Activity ne doivent pas avoir de Super-Partition.
$R1010.message=La Partition ''{0}'' est une Partition racine mais poss\u00E8de des Super-Partitions.
$R1020.description=La source et la cible d'un Flow doivent \u00EAtre contenues dans le m\u00EAme Structured Activity Node.
$R1020.message=La source (''{0}'') et la cible (''{1}'') de ''{2}'' ne sont pas contenues dans le m\u00EAme Structured Activity Node.
$R1030.description=La source et la cible d'un Flow doivent appartenir \u00E0 la m\u00EAme Activity.
$R1030.message=La source (''{0}'') et la cible (''{1}'') de ''{2}'' n''appartiennent pas \u00E0 la m\u00EAme Activity.
$R1040.description=Un Activity Parameter Node doit \u00EAtre repr\u00E9sent\u00E9 par un Behavior Parameter appartenant \u00E0 la m\u00EAme Activity.
$R1040.message=L''Activity Parameter Node ''{0}'' n'est pas repr\u00E9sent\u00E9 par un Behavior Parameter appartenant \u00E0 la m\u00EAme Activity.
$R1050.description=Un Activity Parameter Node doit avoir soit des flux entrants, soit des flux sortants.
$R1050.message=L''Activity Parameter Node ''{0}'' a des flux entrants et des flux sortants.
$R1060.description=Un Activity Parameter Node sans flux entrant et ayant un ou plusieurs flux sortants doit avoir un Behavior Parameter avec passage de param\u00E8tres "Entr\u00E9e" ou "Entr\u00E9e/Sortie".
$R1060.message=L''Activity Parameter Node ''{0}'' a des flux sortants mais le mode de passage de param\u00E8tres de son Behavior Parameter est de type "Sortie".
$R1070.description=Un Activity Parameter Node sans flux sortant et ayant un ou plusieurs flux entrants doit avoir un Behavior Parameter avec passage de param\u00E8tres "Sortie" ou "Entr\u00E9e/Sortie".
$R1070.message=L''Activity Parameter Node ''{0}'' a des flux entrants mais le mode de passage de param\u00E8tres de son Behavior Parameter est de type "Entr\u00E9e".
$R1080.description=Les Partitions de m\u00EAme niveau doivent repr\u00E9senter des Parts appartenant au m\u00EAme Classifier.
$R1080.message=Les Partitions de la Partition ou de l''Activity ''{0}'' repr\u00E9sentent des Parts appartenant \u00E0 differents Classifiers.
$R1090.description=Si une Sub-Partition est non-externe et repr\u00E9sente un Classifier alors le Classifier repr\u00E9sent\u00E9 doit \u00EAtre imbriqu\u00E9 dans le Classifier repr\u00E9sent\u00E9 par sa Super-Partition ou \u00EAtre l'extr\u00E9mit\u00E9 d'une composition avec celui-ci.
$R1090.message=Le Classifier ''{2}'', repr\u00E9sent\u00E9 par la Sub-Partition ''{1}'' n'est pas contenu (via l''imbrication ou la composition) dans le Classifier repr\u00E9sent\u00E9 par la Super-Partition ''{0}''.
$R1100.description=Si une Sub-Partition repr\u00E9sente une Part imbriqu\u00E9 dans un Classifier alors sa Super-Partition doit repr\u00E9senter le Classifier ou une instance de celui-ci.
$R1100.message=La Part ''{1}'', repr\u00E9sent\u00E9e par la Partition ''{2}'' n'est pas imbriqu\u00E9e dans le Classifier ''{0}'' repr\u00E9sent\u00E9 par la Super-Partition ''{3}''.
$R1110.description=Les Pins d'un Call Behavior Action doivent correspondre un pour un \u00E0 des param\u00E8tres "in", "out", "inout" ou "return" du Behaviour appel\u00E9.
$R1110.message=Les Pins de {0} ne correspondent pas un pour un \u00E0 des param\u00E8tres "in", "out", "inout" ou "return" de {1}.
$R1130.description=Le type et la cardinalit\u00E9 maximum du Pin d'un Call Action doivent correspondre au type et \u00E0 la cardinalit\u00E9 maximum du param\u00E8tre repr\u00E9sent\u00E9.
$R1130.message=Le type ou la cardinalit\u00E9 maximum de ''{0}'' ne correspond pas au type ou \u00E0 la cardinalit\u00E9 maximum de ''{1}''.
$R1140.description=Les Pins d'un Call Operation Action doivent correspondre un pour un \u00E0 des param\u00E8tres "in", "inout", "out" ou "return" de l''op\u00E9ration appel\u00E9e.
$R1140.message=Les pins de ''{0}'' ne correspondent pas un pour un \u00E0 des param\u00E8tres de ''{1}''.
$R1150.description=Le Call Operation Action ou le Send Signal Action ne doit pas avoir plus d'un Pin cible.
$R1150.message=Le Call Operation Action ou le Send Signal Action ''{0}'' a plus d''un Pin dont la valeur ''Self'' est \u00E0 vrai.
$R1160.description=Un Pin cible ne peut \u00EAtre contenu que par un Call Operation Action ou un Send Signal Action.
$R1160.message=Le Pin ''{0}'' est un Pin cible (sa valeur ''Self'' est \u00E0 vrai) mais il n''appartient pas \u00E0 une Call Operation Actions ni \u00E0 un Send Signal Action.
$R1170.description=Le type du Pin cible doit \u00EAtre le propi\u00E9taire de l''operation.
$R1170.message=L''appel d''op\u00E9ration ''{0}'' a des pins cibles qui ne sont pas typ\u00E9s par le propri\u00E9taire de l'op\u00E9ration appel\u00E9e.
$R1180.description=Les Control Flows ne doivent pas avoir d'Object Node \u00E0 leurs extr\u00E9mit\u00E9s, sauf dans le cas des Object Nodes de type control.
$R1180.message=Le flux de contr\u00F4le ''{0}'' a comme source ou comme cible un Object Node avec ''Control'' \= false.
$R1190.description=Le Decision-Merge Node est \u00E0 la fois utilis\u00E9 en tant que noeud de Decision et en tant que noeud de Merge.
$R1190.message=Le Decision-Merge Node ''{0}'' poss\u00E8de plus d''un flux entrant et plus d''un flux sortant.
$R1200.description=Les flux entrants et sortants d'un Decision-Merge Node doivent \u00EAtre tous des Object Flows ou tous des Control Flows.
$R1200.message=Le Decision-Merge Node ''{0}'' \u00E0 la fois des Object Flows et les Control Flows.
$R1230.description=Seuls les Control Flows peuvent avoir des Initial Nodes comme source.
$R1230.message=L'Initial Node ''{0}'' a des Object Flows sortants.
$R1250.description=Si un Fork/Join Node a un Object Flow dans ses flux d'entr\u00E9e, il doit avoir un Object Flow dans ses flux de sortie et vice versa. (M\u00EAme chose pour les Control Flows)
$R1250.message=Il y a une incoh\u00E9rence concernant les flows du Fork/Join Node ''{0}''
$R1280.description=Les Object Flows ne peuvent avoir aucune Action \u00E0 leurs extr\u00E9mit\u00E9s.
$R1280.message=L''Object Flow ''{0}'' a des Actions comme source ou cible.
$R1290.description=Les Object Nodes connect\u00E9s par un Object Flow, avec des Control Nodes intervenants facultatifs, doivent avoir des types compatibles. En particulier, le type de l'Object Node en aval doit \u00EAtre le m\u00EAme ou un super-type du type de l'Object Node en amont.
$R1290.message=L''Object Flow ''{0}'' connecte deux Object Nodes, et le type de l'Object Node en aval n''est ni le m\u00EAme ni un super-type du type de l'Object Node en amont.
$R1300.description=Les Object Nodes connect\u00E9s par un Object Flow, avec des Control Nodes intervenants facultatifs, doivent avoir les m\u00EAmes limites sup\u00E9rieures.
$R1300.message=L''Object Flow ''{0}'' connecte deux Object Nodes qui ont des limites sup\u00E9rieures de diff\u00E9rentes valeurs.
$R1310.description=Un flux \u00E0 poids constant ne peut pas cibler un Object Node ni mener \u00E0 un Object Node en aval sans action d'intervention et ayant une limite sup\u00E9rieure inf\u00E9rieure au poids.
$R1310.message=Le flux ''{0}'' a un poids constant sup\u00E9rieur \u00E0 la limite sup\u00E9rieur d''un Object Node qu''il cible ou conduit \u00E0.
$R1320.description=Un Object Flow ne doit pas \u00EAtre \u00E0 la fois multi-cast et multi-receive.
$R1320.message=L''Object Flow ''{0}'' est \u00E0 la fois multi-cast et multi-receive.
$R1350.description=Si un Object Node a un 'Filtre de s\u00E9l\u00E9ction' alors l'Object Node doit \u00EAtre ordonn\u00E9 et vice versa.
$R1350.message=L''Object Node ''{0}'' a un ''Filtre de s\u00E9lection'' mais n''est pas ordonn\u00E9, ou bien il est ordonn\u00E9 mais n''a pas de ''Filtre de s\u00E9l\u00E9ction''.
$R1360.description=Les Input Pins ne peuvent avoir des flux sortants que si les deux conditions suivantes sont remplies \: (1) Ils se trouvent sur des Actions qui sont des Structured Nodes, et (2) Ces flux doivent cibler un noeud contenu par le Structured Node.
$R1360.message=L''Input Pin ''{0}'' ne peut avoir des flux sortants que vers les noeuds dans le corps du propri\u00E9taire.
$R1370.description=Les Output Pins ne peuvent avoir des flux entrants que si les deux conditions suivants sont remplies \: (1) Ils se trouvent sur des Actions qui sont des Structured Nodes, et (2) Ces flux doivent partir d'un noeud contenu par le Structured Node.
$R1370.message=L''Output Pin ''{0}'' ne peut avoir des flux entrants que si ceux-ci partent d''un \u00E9l\u00E9ment dans le corps du propri\u00E9taire.
$R1380.description=Les Pins d'un Send Signal Action doivent correspondre un pour un \u00E0 des Attributs du Signal envoy\u00E9.
$R1380.message=Les Pins de ''{0}'' ne correspondent pas un pour un aux Attributs de ''{1}''.
$R1390.description=La cardinalit\u00E9 maximum d'un Pin d'argument doit \u00EAtre la m\u00EAme que pour l'Attribut repr\u00E9sent\u00E9.
$R1390.message=La cardinalit\u00E9 maximum de ''{0}'' ne correspond pas au type et \u00E0 la cardinalit\u00E9 maximum de ''{1}''.
$R1400.description=Un Activity Parameter Node doit appartenir \u00E0 une Activity.
$R1400.message=L''Activity Parameter Node ''{0}'' appartient \u00E0 une Partition, un Structured Activity Node ou une Conditional Clause.
$R1410.description=Sur une Association, seule une des extr\u00E9mit\u00E9s peut \u00EAte de type agregation ou composition.
$R1410.message=L''association ''{0}'' a plusieurs extr\u00E9mit\u00E9s de type agregation ou composition.
$R1420.description=Un Acteur ou un UseCase ne peut pas avoir d'associations n-aire.
$R1420.message=L''acteur ou le usecase ''{0}'' a une association n-aire.
$R1430.description=Les multiplicit\u00E9s doivent \u00EAtre coh\u00E9rentes\: La multiplicit\u00E9 min ne peut \u00EAtre * et doit \u00EAtre inf\u00E9rieur \u00E0 la multiplicit\u00E9 max.
$R1430.message=L''ext\u00E9mit\u00E9 d''association contenue par ''{1}'' n''a pas des multiplicit\u00E9s coh\u00E9rentes.
$R1450.description=Si une association est une composition, alors la multiplicit\u00E9 max de l'autre extr\u00E9mit\u00E9 doit \u00EAtre 1.
$R1450.message=Une extr\u00E9mit\u00E9 d''association port\u00E9e par ''{1}'' est une compositon mais l''extr\u00E9mit\u00E9 oppos\u00E9e n''a pas une multiplicit\u00E9 max de 1.
$R1460.description=Une association publique venant d'un Classifier publique ne peut pas cibler un Classifier priv\u00E9 ou prot\u00E9g\u00E9.
$R1460.message=Le Classifier publique ''{0}'' a une association orient\u00E9 vers un Classifier priv\u00E9 ou prot\u00E9g\u00E9\: ''{1}''
$R1470.description=Le nom des qualifieurs d'une association doivent \u00EAtre uniques.
$R1470.message=Une association ''{1}'' a plusieurs qualifieurs avec le m\u00EAme nom.
$R1480.description=Un Attribut doit \u00EAtre typ\u00E9 par un \u00E9l\u00E9ment primitif.
$R1480.message=L''attribut ''{0}'' ne peut pas \u00EAtre typ\u00E9 par l''\u00E9l\u00E9ment ''{1}'' ({2}) car ce dernier n''est pas primitif.
$R1490.description=Dans une instance, le type d'un attribute instanci\u00E9 doit \u00EAtre dans la class instanti\u00E9e ou dans ses classes parentes.
$R1490.message=Le lien d''attribut ''{0}'' instancie l''attribut ''{1}'', qui n''est pas dans la classe instanci\u00E9e ni dans ses classes parentes.
$R1500.description=Dans une instance, le nom d'un attribut instanci\u00E9 doit \u00EAtre le m\u00EAme que l'attribut correspondant.
$R1500.message=L''attribut instanci\u00E9 ''{0}'' n''a pas le m\u00EAme nom que l''attribut correspondant ''{1}''.
$R1520.description=Le nom d'une BindableInstance doit \u00EAtre unique dans son Classifier.
$R1520.message=Il y a plusieurs BindableInstance avec le m\u00EAme nom ({1}) dans le Classifier ''{0}''.
$R1530.description=Une association ou un port devrait avoir un nom.
$R1530.message=L''\u00E9l\u00E9ment de metaclasse ''{0}'' devrait avoir un nom.
$R1540.description=Une Bindable Instance ne peut se repr\u00E8senter elle m\u00EAme, directement ou indirectement.
$R1540.message=La Bindable Instance ''{0}'' se repr\u00E8senter elle m\u00EAme, directement ou indirectement.
$R1550.description=Si une Bindable Instance a un type et repr\u00E9sente une Feature, alors le type de l'instance doit \u00EAtre compatible avec cette Feature.
$R1550.message=Le type de la Bindable Instance ''{0}'' n''est pas compatiblr avec le type de ''{1}''.
$R1560.description=Les sous classes d'une classe active doivent \u00EAtre actives.
$R1560.message=La classe active ''{0}'' a une sous classe qui n''est pas active\: ''{1}''.
$R1580.description=Les Attributs, les Associations et les Operations ne peuvent pas \u00EAtre \u00E0 la fois abstraits et de classe.
$R1580.message=l''\u00E9l\u00E9ment ''{0}'' ({1}) ne peut pas \u00EAtre \u00E0 la fois abstrait et de classe.
$R1590.description=Les General Class primitives ne peuvent pas avoir d'associations.
$R1590.message=La classe primitive ''{0}'' a des associations.
$R1600.description=Une classe primitive ne peut avoir de collaboration.
$R1600.message=La classe ''{0}'' est primitive et a des collaborations.
$R1610.description=Une classe primitive ne peux pas avoir de machine \u00E0 \u00E9tats.
$R1610.message=La classe ''{0}'' est primitive et a une machine \u00E0 \u00E9tats.
$R1620.description=Un Classifier non abtsrait ne peut pas avoir de m\u00E9thodes abstraites.
$R1620.message=Le Classifier ''{0}'' n''est pas abstrait mais poss\u00E8de des m\u00E9thodes abstraites.
$R1640.description=Il ne peut y avoir plus d'un ElementImport entre deux NameSpace ou entre une Operation et un NameSPace.
$R1640.message=L''\u00E9l\u00E9ment ''{0}'' ({1}) a plus d''un ElementImport vers ''{2}''.
$R1650.description=Une \u00E9num\u00E9ration ne peut pas \u00EAtre abstraite.
$R1650.message=L''\u00E9num\u00E9ration ''{0}'' est abstraite.
$R1660.description=Une \u00E9num\u00E9ration est toujours primitive.
$R1660.message=L''\u00E9num\u00E9ration ''{0}'' n''est pas primitive.
$R1670.description=Les Enumeration Litteral d'une \u00E9num\u00E9ration doivent avoir un nom unique.
$R1670.message=L''\u00E9num\u00E9ration ''{0}'' contient plusieurs Enumeration Litteral avec le m\u00EAme nom\: ''{1}''.
$R1680.description=Le champ 'Called operation' doit \u00EAtre d\u00E9fini pour un Event de type Call, tandis que le champ 'Instanciated signal' doit \u00EAtre vide.
$R1680.message=L''Event ''{0}'' est un Event de type Call, mais soit son champ ''called operation'' n''est pas d\u00E9fini, soit son champ 'Instanciated signal' n''est pas vide.
$R1690.description=Le champ 'Expression' d'un Event de type Change doit \u00EAtre d\u00E9fini, tandis que les champs 'Called operation' et 'Instanciated signal' doivent \u00EAtre vides.
$R1690.message=L''Event ''{0}'' est un Change-type Event, mais soit son champ ''Expression'' n''est pas d\u00E9fini, soit ses champs ''Called operation'' ou ''Instanciated signal'' ne sont pas vides.
$R1700.description=Le champ 'Instantiated signal' d'un Event de type Signal doit \u00EAtre d\u00E9fini, tandis que les champs 'Called operation' et 'Expression' doivent \u00EAtre vides.
$R1700.message=L''Event ''{0}'' est un Event de type Signal, mais soit son champ ''Instantiated signal'' n'est pas d\u00E9fini, soit ses champs ''Called operation'' ou ''Expression'' ne sont pas vides.
$R1710.description=Le champ 'Expression' d'un Event de type Time doit \u00EAtre d\u00E9fini, tandis que les champs 'Called operation' et 'Instanciated signal' doivent \u00EAtre vides.
$R1710.message=L''Event ''{0}'' est un Event de type Time, mais soit son champ ''Expression'' n''est pas d\u00E9fini, soit ses champs ''Called operation'' ou ''Instanciated signal'' ne sont pas vides.
$R1720.description=Un Namespace abstrait devrait seulement h\u00E9riter d'un autre Namespace abstrait.
$R1720.message=Le Namespace abstrait ''{0}'' h\u00E9rite d''un Namespace non abstrait.
$R1730.description=Une g\u00E9n\u00E9ralisation doit \u00EAtre cr\u00E9\u00E9e entre deux \u00E9l\u00E9ments de mod\u00E8les du m\u00EAme type, sauf dans le cas d'un signal, qui peut sp\u00E9cialiser soit un signal soit une classe.
$R1730.message=Il y a une g\u00E9n\u00E9ralisation entre ''{1}'' et ''{2}'' mais ils ne sont pas compatibles.
$R1740.description=Un Information Flow doit convoyer de l'information.
$R1740.message=L''Information Flow ne convoit pas d''information.
$R1750.description=Les r\u00E9p\u00E9titions de noms sont interdites pour les Attribute Links.
$R1750.message=L''instance ''{0}'' contient plusieurs Attribute Links avec le m\u00EAme nom\: ''{1}''.
$R1760.description=Il ne peut y avoir d'incoh\u00E9r\u00E9nce dans les multiplict\u00E9s d'une Instance.
$R1760.message=La multiplicit\u00E9 minimum ({1}) de l''Instance ''{0}'' est plus grande que la multiplicit\u00E9 maximum ({2}).
$R1780.description=Le nom d'une Instance doit \u00EAtre unique dans son Namespace.
$R1780.message=Il y a plusieurs Instances avec le m\u00EAme nom ({1}) dans le Namespace ''{0}''.
$R1790.description=Une Instance doit avoir un nom ou l'association d'instanciation doit \u00EAtre d\u00E9finie.
$R1790.message=Une Instance n''a pas de nom, ou son association d'instanciation n''est pas d\u00E9finie.
$R1800.description=Si l'Operator est opt, loop, break, ou neg, il ne peut y avoir plus d'une Operand.
$R1800.message=Le CombinedFragment ''{0}'' a un Operator de type opt, loop, break, ou neg, mais il a plus d''une Operand.
$R1810.description=Une Gate (r\u00E9elle) sur un InteractionUse doit r\u00E9f\u00E9rencer une Gate (formelle) de l'interaction r\u00E9f\u00E9renc\u00E9e.
$R1810.message=La Gate (r\u00E9elle) ''{0}'' r\u00E9f\u00E9rence une Gate (formelle) qui n''appartient pas \u00E0 l''Interaction r\u00E9f\u00E9renc\u00E9e.
$R1820.description=Une Gate ne peut pas couvrir une lifeline.
$R1820.message=La Gate ''{0}'' couvre une lifeline
$R1830.description=Une PartDecompoistion ne peut pas recevoir de messages de type 'create' ou 'destroy'.
$R1830.message=La PartDecomposition ''{0}'' re\u00E7oit des messages de type ''create'' ou ''destroy''
$R1860.description=Sur une Interface, la visibilit\u00E9 des Features doit \u00EAtre publique.
$R1860.message=L''Interface ''{0}'' a une Feature non publique \: ''{1}''
$R1870.description=Une Interface ne peut pas \u00EAtre impl\u00E9ment\u00E9e deux fois par la m\u00EAme classe ou le m\u00EAme composant.
$R1870.message=Le Namespace ''{1}'' impl\u00E9mente l''Interface ''{0}'' plusieurs fois.
$R1910.description=Un lien qui instancie une association doit \u00EAtre coh\u00E9rent avec cette association.
$R1910.message=Le lien ''{0}'' n''est pas coh\u00E9rent avec l''association qu''il instancie.
$R1950.description=Les messages de type 'reply' ne peuvent pas invoquer une op\u00E9ration.
$R1950.message=Le message''{0}'' invoque une op\u00E9ration mais est de type ''reply''.
$R1960.description=Un Message doit porter le m\u00EAme nom que l'op\u00E9ration qu'il invoque.
$R1960.message=Le message ''{0}'' n''a pas le m\u00EAme nom que l''op\u00E9ration ''{1}'' invoqu\u00E9e.
$R1970.description=Un TemplateParameterSubsitution doit r\u00E9f\u00E9rencer un TemplateParameter.
$R1970.message=Un TemplateParameterSubsitution de l'\u00E9l\u00E9ment ''{0}'' ne r\u00E9f\u00E9rence aucun TemplateParameter.
$R1980.description=Les noms des attributs et des extr\u00E9mit\u00E9 d'association d'un Classifier doivent \u00EAtre uniques.
$R1980.message=Le Classifier ''{0}'' a plusieurs attributs ou extr\u00E9mit\u00E9s d''association avec le m\u00EAme nom\: ''{1}''.
$R1990.description=Les noms des attributs et des r\u00F4les h\u00E9rit\u00E9s par un Classifier doivent \u00EAtre uniques.
$R1990.message=Le Classifier ''{0}'' h\u00E9rite des attributs ou des r\u00F4les qui ont le m\u00EAme nom\: {1}
$R2050.description=Certains \u00E9l\u00E9ments doivent avoir un nom.
$R2050.message=Un \u00E9l\u00E9ment de type ''{0}'' doit avoir un nom.
$R2060.description=Le nom d'un Namespace doit \u00EAtre unique dans son Namespace.
$R2060.message=Il y a plusieurs Namespaces du m\u00EAme nom dans le Namespace ''{0}''.
$R2170.description=Le nom d'un Behavior doit \u00EAtre unique dans son NameSpace.
$R2170.message=Il y a plusieurs Behaviors appel\u00E9s ({1}) dans le NameSpace ''{0}''.
$R2180.description=Il ne peut y avoir de cycles dans le graphe d'h\u00E9ritage d'un Namespace.
$R2180.message=Le Namespace ''{0}'' fait partie d''une cycle d''h\u00E9ritage.
$R2190.description=Il ne peut y avoir qu'une g\u00E9n\u00E9ralisation entre deux Namespaces.
$R2190.message=Le Namespace ''{0}'' sp\u00E9cialise le Namespace ''{1}'' plusieurs fois.
$R2200.description=Un NameSPace ne peut pas d\u00E8river et importer un autre Namespace.
$R2200.message=Le Namespace ''{0}'' d\u00E8rive et importe un autre Namespace.
$R2210.description=Un Namespace feuille ne peut pas \u00EAtre d\u00E9riv\u00E9.
$R2210.message=Le Namespace ''{0}'' est une feuille mais est d\u00E9riv\u00E9.
$R2220.description=Un Namespace feuille ne peut pas \u00EAtre abstrait
$R2220.message=Le Namespace ''{0}'' est une feuille mais est abstrait
$R2230.description=Un Namespace racine ne peut pas h\u00E9riter d'un autre Namespace.
$R2230.message=Le Namespace ''{0}'' est racine et h\u00E9rite d''un autre Namespace.
$R2250.description=Toutes les op\u00E9rations d'un Classifier doivent avoir des signatures diff\u00E8rentes des op\u00E9rations publiques et prot\u00E8g\u00E8es h\u00E8rit\u00E8es. Sauf en ce qui concerne les constructeurs, les destructeurs, et les op\u00E9rations d\u00E8riv\u00E8es.
$R2250.message=Le Classifier ''{0}'' contient une op\u00E9ration ''{1}'' masquant l''op\u00E9ration ''{2}'' h\u00E9rit\u00E9e du Classifier ''{3}''.
$R2260.description=Chaque op\u00E9ration d'un Classifier doivent avoir une signature diff\u00E9rente.
$R2260.message=Le Classifier ''{1}'' a plusieurs op\u00E9rations avec la m\u00EAme signature.
$R2270.description=Toutes les collaborations d'une op\u00E9ration doivent avoir des noms diff\u00E9rents.
$R2270.message=L''op\u00E9ration ''{0}'' a au moins deux collaborations avec le m\u00EAme nom.
$R2330.description=Tous les param\u00E8tres d'une op\u00E9ration doivent avoir des noms diff\u00E9rents.
$R2330.message=L''op\u00E9ration ''{0}'' a plusieurs param\u00E8tres avec le m\u00EAme nom\: {1}
$R2340.description=Un op\u00E9ration red\u00E9finie doit appartenir a un parent on a une Interface impl\u00E9ment\u00E9e par le parent de l'op\u00E9ration.
$R2340.message=L''op\u00E9ration ''{0}'' red\u00E9finie une op\u00E9ration qui n''appartient pas \u00E0 un parent ou \u00E0 une Interface impl\u00E9ment\u00E9e pas le parent de l''op\u00E9ration.
$R2350.description=Une Op\u00E9ration priv\u00E9e ne peut \u00EAtre red\u00E9finie.
$R2350.message=L''Op\u00E9ration ''{0}'' est priv\u00E9e et est red\u00E9finie.
$R2360.description=La visibilit\u00E9 d'une op\u00E9ration ne peut \u00EAtre plus grande que la visbilit\u00E9 de l'op\u00E9ration qu'elle red\u00E9finie.
$R2360.message=L''op\u00E9ration ''{0}'' a une visibilit\u00E9 plus grande que l''op\u00E9ration qu''elle red\u00E9finie.
$R2370.description=Une op\u00E9ration de classe (statique) ne peut \u00EAtre red\u00E9finie.
$R2370.message=L''op\u00E9ration ''{0}'' est une op\u00E9ration statique et est red\u00E9finie.
$R2380.description=Une op\u00E9ration abstraite ne peut red\u00E9finir une op\u00E9ration concrete.
$R2380.message=L''op\u00E9ration ''{0}'' est abstraite et red\u00E9finie l''op\u00E9ration ''{1}'' qui est concrete.
$R2390.description=Un constructeur ne peut pas avoir de param\u00E8tre de retour.
$R2390.message=Le constructeur ''{0}'' a un param\u00E8tre de retour.
$R2400.description=Un destructeur ne peux pas avoir de param\u00E8tre.
$R2400.message=Le destructeur ''{0}'' a des param\u00E8tres.
$R2410.description=Une op\u00E9ration ne peut pas avoir les deux st\u00E9r\u00E9otypes 'create' et 'destroy' \u00E0 la fois.
$R2410.message=L''op\u00E9ration ''{0}'' a les deux st\u00E9r\u00E9otypes ''create'' et ''destroy'' \u00E0 la fois.
$R2420.description=Une op\u00E9ration doit avoir la m\u00EAme signature que l'op\u00E9ration qu'elle red\u00E9finie.
$R2420.message=L''op\u00E9ration ''{0}'' red\u00E9finie une op\u00E9ration mais les signatures ne sont pas identiques.
$R2430.description=Toutes les machines \u00E0 \u00E9tats d'une op\u00E9ration doivent avoir des noms diff\u00E9rents.
$R2430.message=L''op\u00E9ration ''{0}'' a plusieurs machine \u00E0 \u00E9tats avec le m\u00EAme nom\: {1}
$R2440.description=Une op\u00E9ration ne peut pas appartenir a une \u00E9num\u00E9ration
$R2440.message=L''\u00E9num\u00E9ration ''{0}'' contient une op\u00E9ration.
$R2450.description=Un Package ne peut pas avoir de liens d'h\u00E9ritage.
$R2450.message=Le Package ''{0}'' a des liens d''h\u00E9ritage.
$R2470.description=Un NameSpace ne peut avoir plus d'un lien PackageImport vers un package.
$R2470.message=Le NameSpace ''{0}'' a plus d''un lien PackageImport avec le package ''{1}''.
$R2500.description=Un param\u00E8tre 'out' ne peut pas avoir de valeur par d\u00E9faut.
$R2500.message=Le param\u00E8tre ''out'' ''{0}'' a une valeur par d\u00E9faut.
$R2510.description=Il ne peut y avoir de lien direct entre deux ports.
$R2510.message=Il y a un lien entre un port de la classe ''{0}'' et un port de la classe ''{1}''.
$R2520.description=Si un Port a une delegation vers une part, il doit fournir au moins une Interface.
$R2520.message=Le port ''{0}'' a une delegation vers une part et ne fournit aucune Interface.
$R2530.description=Si un port re\u00E7oit une delegation d'une part, il doit fournir au moins une Interface.
$R2530.message=Le port ''{0}'' re\u00E7oit une delegation d''une part mais ne fournit aucune Interface.
$R2540.description=Les Interfaces fournies par un port doivent \u00EAtre impl\u00E9ment\u00E9es par la classe qui type ce port.
$R2540.message=Le port ''{0}'' fourni des Interfaces qui ne sont pas impl\u00E9ment\u00E9es par la classe qui type le port.
$R2550.description=Si un Port est un Behavior Port, les Interfaces qu'il fournit doivent \u00EAtre impl\u00E9ment\u00E9es par la classe auquel il appartient.
$R2550.message=Le port ''{0}'' est un Behavior Port, mais il fournit des Interfaces qui ne sont pas impl\u00E9ment\u00E9es par la classe qui le contient.
$R2550_.message=Le port ''{0}'' fourni des Interfaces qui ne sont pas impl\u00E9ment\u00E9es par la Classe \u00E0 laquelle il appartient.
$R2560.description=Un Behaviour Port doit fournir au moins une Interface.
$R2560.message=Le port ''{0}'' est un Behaviour Port mais ne fournit aucune Interface.
$R2570.description=Le type d'un Behavior Port doit \u00EAtre soit la classe auquel il appartient soit non d\u00E8fini.
$R2570.message=Le behavior port ''{0}'' a pour type\: ''{1}''.
$R2580.description=Une r\u00E9gion ne peut pas contenir plus d'un \u00E9tat de type deep history.
$R2580.message=La r\u00E9gion ''{0}'' contient plus d''un \u00E9tat de type deep history.
$R2590.description=Une r\u00E9gion ne peut pas contenir plus d'un \u00E9tat initial.
$R2590.message=La r\u00E9gion ''{0}'' contient plus d''un \u00E9tat initial.
$R2600.description=Une machine \u00E0 \u00E9tats ou un \u00E9tat ne peut pas contenir deux \u00E9tats ayant le m\u00EAme nom.
$R2600.message=La machine \u00E0 \u00E9tats ou l''\u00E9tat ''{0}'' a au moins deux \u00E9tats de m\u00EAme nom.
$R2610.description=Seul les \u00E9tats repr\u00E9sentant une sous machine peuvent avoir des \u00E9tats de type connection point reference.
$R2610.message=L''\u00E9tat ''{0}'' n''est pas une sous machine et a une \u00E9tat de type connection point reference.
$R2620.description=Les \u00E9tats repr\u00E9sentant une sous machine ne peuvent avoir d'\u00E9tats de type entry ou exit point d\u00E9finis.
$R2620.message=L''\u00E9tat ''{0}'' repr\u00E9sente une sous machine et a un \u00E9tat de type entry ou exit point d\u00E9fini.
$R2630.description=Une r\u00E9gion ne peut pas contenir plus d'un \u00E9tat de type shallow history.
$R2630.message=La r\u00E9gion ''{0}'' contient plus d''un \u00E9tate de type shallow history.
$R2640.description=Le contexte d'une machine \u00E0 \u00E9tats ne peut pas \u00EAtre une Interface.
$R2640.message=Le contexte de la machine \u00E0 \u00E9tats ''{0}'' est une Interface.
$R2650.description=Le contexte d'une machine \u00E0 \u00E9tats protocolaire doit \u00EAtre un Classifier.
$R2650.message=Le contexte de la machine \u00E0 \u00E9tats protocolaire ''{0}'' n''est pas un Classifier.
$R2660.description=Un \u00E9tat d'une machine \u00E0 \u00E9tats protocolaire ne doit pas avoir de 'entry', 'exit', ou 'do' actions d'activit\u00E9.
$R2660.message=L''\u00E9tat ''{0}'' fait partie d''une machine \u00E0 \u00E9tats protocolaire et a une ''entry'', ''exit'', ou ''do'' action d''activit\u00E9.
$R2670.description=Une machine \u00E0 \u00E9tats protocolaire ne peut pas avoir d'\u00E9tats historiques.
$R2670.message=La machine \u00E0 \u00E9tats protocolaire ''{0}'' a un \u00E9tat historique.
$R2690.description=Un \u00E9l\u00E9ment ne peut avoir un TemplateBindind vers lui m\u00EAme.
$R2690.message=L''\u00E9l\u00E9ment ''{0}'' a un TemplateBinding vers lui-m\u00EAme.
$R2700.description=Un TemplateBinding ne peut substituer un TemplateParameter de l'\u00E9l\u00E9ment instanci\u00E9 qu'une seule fois.
$R2700.message=Le TemplateBinding ''{0}'' substitue le TemplateParameter ''{1}'' plusieurs fois.
$R2720.description=Un TemplateBinding doit \u00EAtre entre deux \u00E9l\u00E9ments de m\u00EAme type ou entre une Class et un DataType.
$R2720.message=Le TemplateBinding ''{0}'' n''est pas entre deux \u00E9l\u00E9ments du m\u00EAme type, ni entre une Class et un DataType.
$R2730.description=Un TemplateBinding doit substituer tous les TemplateParameters de l'\u00E9l\u00E9ment instanti\u00E9, et les TemplateParameterSubstitution doivent \u00EAtre d\u00E9finis dans le m\u00EAme ordre que les TemplateParameters.
$R2730.message=Le TemplateBinding ''{0}'' ne substitue pas tout les TemplateParameters de l''\u00E9l\u00E9ment instantier, ou ne d\u00E9fini pas ses TemplateParameterSubstitution dans le m\u00EAme ordre que les TemplateParameters.
$R2740.description=Dans un TemplateBinding, les TemplateParameterSubstitution doivent appartenir \u00E0 l'\u00E9l\u00E9ment instanci\u00E9;
$R2740.message=Le Templatebinding ''{0}'' contient des TemplateParameterSubstitution qui n''appartiennent pas \u00E0 l''\u00E9l\u00E9ment instanci\u00E9;
$R2750.description=Une transition ayant pour origine un \u00E9tat de fork ou join ne doit pas avoir de guard ou de trigger.
$R2750.message=La transition d''origine ''{1}'' ayant pour cible ''{2}'' a une guard ou un trigger.
$R2760.description=Une transition partant d'un fork doit toujours cibl\u00E9 un \u00E9tat.
$R2760.message=La transition partant du fork ''{0}'' ne cible pas un \u00E9tat.
$R2770.description=Une transition ciblant un join doit toujour partir d'un \u00E9tat.
$R2770.message=La transition ciblant le join ''{0}'' ne vient pas d''un \u00E9tat.
$R2780.description=Les transitions ciblant des pseudo \u00E9tats ne peuvent pas avoir de trigger (\u00E0 l'exception de ceux venant du pseudostate initial).
$R2780.message=La transition de ''{1}'' vers {3} ''{2}'' a un trigger.
$R2790.description=Une transiton d'une r\u00E9gion \u00E0 une autre dans le m\u00EAm\u00E9 \u00E9tat n'est pas autoris\u00E9e.
$R2790.message=L''\u00E9tat ''{3}'' a une transition de sa r\u00E9gion ''{1}'' vers sa r\u00E9gion ''{2}''.
$R2800.description=Un \u00E9tat initial ne peut pas avoir plus d'une transition sortante.
$R2800.message=L''\u00E9tat initial ''{0}'' a plus d''une transition sortante.
$R2810.description=Les \u00E9tats historiques ne peuvent pas avoir plus d'une transition sortante.
$R2810.message=L''\u00E9tat historique ''{0}'' a plus d''une transition sortante.
$R2820.description=La cible d'une transition ne peut pas \u00EAtres un \u00E9tat initial.
$R2820.message=Une transition a pour cible l''\u00E9tat initial ''{1}''.
$R2830.description=La source d'une transition ne peut pas \u00EAtre un \u00E9tat final.
$R2830.message=Une transition a comme source l''\u00E9tat final ''{1}''.
$R2840.description=Une transition ne devrait avoir qu'un des \u00E9l\u00E9ments suivants definis\: Processed, Effects, or BehaviorEffet.
$R2840.message=La transition de ''{1}'' vers ''{2}'' a plus d''une des propri\u00E9t\u00E9s suivantes d\u00E9finies\: Processed, Effects, or BehaviorEffet defined.
$R2860.description=Il ne peut y avoir qu'une relation d'extension/inclusion entre deux Use Cases.
$R2860.message=Le Use Case ''{0}'' a plus d''une relation d''extension/inclusion vers un autre Use Case.
$R2870.description=Il ne peut y avoir de cycle de relation d'extension entre Use Cases.
$R2870.message=Le Use Case ''{0}'' fait partie d''un cycle de relation d''extension.
$R2880.description=Il ne peut y avoir de cycle de relation d'inclusion entre Use Cases.
$R2880.message=Le Use Case ''{0}'' fait partie d''un cycle de relation d''inclusion.
$R2890.description=Un lien de communication ne peut \u00EAtre r\u00E9flexif.
$R2890.message=''{1}'' a un lien de communication r\u00E9flexif.
$R2900.description=Une relation d'extension doit r\u00E9f\u00E9rencer au moins un Extension Point.
$R2900.message=Une relation d''extension entre ''{0}'' et ''{1}'' ne r\u00E9f\u00E9rence aucun Extension Point.
$R2910.description=Une relation d'extension ne peut r\u00E9f\u00E9rencer que des Extension Points appartenant au Use Case cible.
$R2910.message=Une relation d''extension entre ''{0}'' et ''{1}'' r\u00E9f\u00E9rence des Extension Points qui n''appartiennent pas au Use Case cible.
$R2920.description=Un Extension Point ne peut \u00EAtre r\u00E9f\u00E9renc\u00E9 que par une relation d'extension.
$R2920.message=Une relation entre ''{0}'' et ''{1}'' r\u00E9f\u00E9rence des Extension Points mais n''est pas de type extension.
$R2930.description=Un Message ou Communication Message ne peut pas avoir un Signal et une Op\u00E9ration d\u00E9finis en m\u00EAme temps.
$R2930.message=Le {1} ''{0}'' a un Signal et une Op\u00E9ration d\u00E9finis en m\u00EAme temps.
$R2940.description=Toutes les transitions arrivant sur un Join doivent venir d'\u00E9tat de diff\u00E9rentes r\u00E9gions au sein d'un m\u00EAme \u00E9tat.
$R2940.message=L''\u00E9tat de join ''{0}'' a des transitions qui viennent d''\u00E9tats de la m\u00EAme r\u00E9gion ou de diff\u00E9rents \u00E9tats.
$R2950.description=Toutes les transitions sortant d'un fork doivent cibler difr\u00E9rentes r\u00E9gions au sein d'un m\u00EAme \u00E9tat.
$R2950.message=L''\u00E9tat de fork ''{0}'' a des transitions qui ciblent des \u00E9tats d''une m\u00EAme r\u00E9gion ou des \u00E9tats diff\u00E9rents.

BpmnDataObjectsContainer.Multi={0} donn\u00E9es
BpmnDataObjectsContainer.Single={0} donn\u00E9e
BpmnEventDefinitionType.indent=\u00A0\u00A0\u00A0
BpmnEventDefinitionType.label=Type\: {0}
BpmnEventsContainer.Multi={0} \u00E9v\u00E9nements
BpmnEventsContainer.Single={0} \u00E9v\u00E9nement
BpmnMessageFlowsContainer.Multi={0} messages
BpmnMessageFlowsContainer.Single={0} message
BpmnRolesContainer.Multi={0} r\u00F4les
BpmnRolesContainer.Single={0} r\u00F4le
BpmnTasksContainer.Multi={0} t\u00E2ches
BpmnTasksContainer.Single={0} t\u00E2che

From=de

IsA=Est un

NoBase=<pas de base>
NoName=<pas de nom>
NoType=<pas de type>
