# Generated file, please do not edit.
# Use the Pollux tool instead.
$E-Archi-Access.desc=An access relationship may only link behavioural concepts to business or data objects.
$E-Archi-Access.what=An access relationship cannot link ''{1}'' to ''{2}''
$E-Archi-Aggregation.desc=An Aggregation relationship may only link elements permitted by the ArchiMate specification.
$E-Archi-Aggregation.what=An Aggregation relationship cannot link ''{1}'' to ''{2}''
$E-Archi-Assignment.desc=An Assignment relationship may only link elements permitted by the ArchiMate specification.
$E-Archi-Assignment.what=An Assignment relationship cannot link ''{1}'' to ''{2}''
$E-Archi-Composition.desc=A Composition relationship may only link elements permitted by the ArchiMate specification.
$E-Archi-Composition.what=A Composition relationship cannot link ''{1}'' to ''{2}''
$E-Archi-Flow.desc=A Flow relationship may only link elements permitted by the ArchiMate specification.
$E-Archi-Flow.what=A Flow relationship cannot link ''{1}'' to ''{2}''
$E-Archi-Influence.desc=An Influence relationship may only link elements permitted by the ArchiMate specification.
$E-Archi-Influence.what=An Influence relationship cannot link ''{1}'' to ''{2}''
$E-Archi-Realization.desc=A Realization relationship may only link elements permitted by the ArchiMate specification.
$E-Archi-Realization.what=A Realization relationship cannot link ''{1}'' to ''{2}''
$E-Archi-Serving.desc=A Serving relationship may only link elements permitted by the ArchiMate specification.
$E-Archi-Serving.what=A Serving relationship cannot link ''{1}'' to ''{2}''
$E-Archi-Specialization.desc=A Specialization relationship may only link elements permitted by the ArchiMate specification.
$E-Archi-Specialization.what=A Specialization relationship cannot link ''{1}'' to ''{2}''
$E-Archi-Triggering.desc=A Triggering relationship may only link elements permitted by the ArchiMate specification.
$E-Archi-Triggering.what=A Triggering relationship cannot link ''{1}'' to ''{2}''
$E200.desc=La relation "reach" ne doit pas \u00EAtre renseign\u00E9e dans une InternalTransition.
$E200.what=La relation "reach" de l''internal transition ''{0}'' ne doit pas \u00EAtre renseign\u00E9e.
$E201.desc=Un Parameter ne peut pas \u00EAtre \u00E0 la fois un Parameter entr\u00E9e/sortie et un ReturnParameter.
$E201.what=Le param\u00E8tre ''{0}'' ne peut pas \u00EAtre \u00E0 la fois un param\u00E8tre entr\u00E9e/sortie et un param\u00E8tre de retour.
$E202.desc=Dans une Transition, la relation "Processing" et l'Attribute "Effect" ne doivent pas \u00EAtre renseign\u00E9s en m\u00EAme temps.
$E202.what=La transition ''{0}'' ne peut pas renseigner \u00E0 la fois la relation "Processing" vers la m\u00E9thode ''{1}'' et l''attribut "Effect" avec la valeur ''{2}''.
$E203.desc=Dans une Transition, la relation "Trigger" et l'Attribute "ReceivedEvents" ne doivent pas \u00EAtre renseign\u00E9s en m\u00EAme temps.
$E203.what=La transition ''{0}'' ne peut pas renseigner \u00E0 la fois la relation "Trigger" vers l''\u00E9v\u00E8nement ''{1}'' et l''attribut "ReceivedEvents" avec la valeur ''{2}''.
$E204.desc=Un StateMachine peut appartenir \u00E0 une Operation ou \u00E0 tout NameSpace (except\u00E9 les DataTypes, les classes primitives, les Enumerations et les Template Parameters).
$E204.what=Le StateMachine ''{1}'' ne peut pas appartenir \u00E0 l''\u00E9l\u00E9ment ''{2}'' ({3}).
$E205.desc=Un ModelElement doit appartenir \u00E0 un autre ModelElement, except\u00E9 les Projects UML.
$E205.what=L''\u00E9l\u00E9ment ''{0}'' est orphelin \: il n''a pas de conteneur.
$E206.desc=Une Operation ne peut pas se red\u00E9finir elle-m\u00EAme.
$E206.what=L''op\u00E9ration ''{0}'' ne doit pas se red\u00E9finir elle-m\u00EAme.
$E207.desc=Dans une Transition, la relation "Effects" et l'Attribute "SentEvents" ne doivent pas \u00EAtre renseign\u00E9s en m\u00EAme temps.
$E207.what=La transition ''{0}'' ne doit pas renseigner \u00E0 la fois la relation "SendEvents" vers le signal ''{1}'' et l''attribut "SentEvents" avec la valeur ''{2}''.
$E208.desc=Une UseCaseDependency doit \u00EAtre st\u00E9r\u00E9otyp\u00E9e <<include>> ou <<extend>>.
$E208.what=La d\u00E9pendance entre les cas d''utilisation ''{1}'' et ''{2}'' n''est pas st\u00E9r\u00E9otyp\u00E9e <<include>> ou <<extend>>.
$E209.desc=La relation "start" ne doit pas \u00EAtre renseign\u00E9e dans une InternalTransition.
$E209.what=La relation "start" de la transition interne ''{0}'' ne doit pas \u00EAtre renseign\u00E9e.
$E210.desc=Une Association doit poss\u00E9der au moins deux AssociationEnds.
$E210.what=L''association ''{0}'' poss\u00E8de {4} r\u00F4les au lieu de deux.
$E211.BOTHSIDES.SOURCE.desc=Un r\u00F4le navigable dans les deux sens doit avoir une source.
$E211.BOTHSIDES.SOURCE.what=Le r\u00F4le {1} n''a pas de source.
$E211.BOTHSIDES.SOURCE_EQ_OPPTARGET.desc=La source d'un r\u00F4le navigable dans les deux sens doit \u00EAtre \u00E9gale que la cible du r\u00F4le oppos\u00E9.
$E211.BOTHSIDES.SOURCE_EQ_OPPTARGET.what=La source du r\u00F4le {1} n'est pas \u00E9gale \u00E0 la cible du r\u00F4le {2}. <ul><li> Source de {1} \: {3}\n <li> Cible de {2} \: {4}</ul>
$E211.BOTHSIDES.TARGET.desc=Un r\u00F4le navigable dans les deux sens doit avoir une cible.
$E211.BOTHSIDES.TARGET.what=Le r\u00F4le {1} n''a pas de cible.
$E211.BOTHSIDES.TARGET_EQ_OPPSOURCE.desc=La cible d'un r\u00F4le navigable dans les deux sens doit \u00EAtre \u00E9gale que la source du r\u00F4le oppos\u00E9.
$E211.BOTHSIDES.TARGET_EQ_OPPSOURCE.what=La cible du r\u00F4le {1} n'est pas \u00E9gale \u00E0 la source du r\u00F4le {2}. <ul><li> Cible de {1} \: {3}\n <li> source de {2} \: {4}</ul>
$E211.OTHERSIDE.OPPSOURCE.desc=Le r\u00F4le oppos\u00E9 \u00E0 un r\u00F4le non-navigable doit avoir une source.
$E211.OTHERSIDE.OPPSOURCE.what=Le r\u00F4le {2} oppos\u00E9 au r\u00F4le {1} n''a pas de source.
$E211.OTHERSIDE.OPPTARGET.desc=Le r\u00F4le oppos\u00E9 \u00E0 un r\u00F4le non-navigable doit avoir une cible.
$E211.OTHERSIDE.OPPTARGET.what=Le r\u00F4le {2} oppos\u00E9 au r\u00F4le {1} n''a pas de cible.
$E211.OTHERSIDE.SOURCE.desc=Un r\u00F4le non-navigable ne peut pas avoir de source.
$E211.OTHERSIDE.SOURCE.what=Le r\u00F4le non-navigable {1} a une source \: {2} .
$E211.OTHERSIDE.TARGET.desc=Un r\u00F4le non-navigable ne peut pas avoir de cible.
$E211.OTHERSIDE.TARGET.what=Le r\u00F4le non-navigable {1} a une source \: {2} .
$E211.THISSIDE.OPPSOURCE.desc=Le r\u00F4le oppos\u00E9 d'une association non-navigable doit avoir une source.
$E211.THISSIDE.OPPSOURCE.what=Le r\u00F4le oppos\u00E9 {2} de {1} n''a pas de source
$E211.THISSIDE.OPPTARGET.desc=Le r\u00F4le oppos\u00E9 d'une association non-navigable ne doit pas avoir de cible.
$E211.THISSIDE.OPPTARGET.what=Le r\u00F4le {2} oppos\u00E9 au r\u00F4le {1} a une cible \: {3}
$E211.THISSIDE.SOURCE.desc=Les r\u00F4les d'une association non-navigable doivent avoir une source.
$E211.THISSIDE.SOURCE.what=Le r\u00F4le {1} n''a pas de source.
$E211.THISSIDE.TARGET.desc=Les r\u00F4les d'une association non-navigable ne doivent pas avoir de cible.
$E211.THISSIDE.TARGET.what=Le r\u00F4le {1} a une cible \: {2}
$E211.desc=Une Association doit respecter les r\u00EAgles suivantes \:<ul><li>Une AssociationEnd doit \u00EAtre reli\u00E9e \u00E0 une Association.\n<li>Pour les r\u00F4les navigables \: seules les source et cible du r\u00F4le courant doivent \u00EAtre renseign\u00E9es.\n<li>Pour les r\u00F4les oppos\u00E9s \: seules les source et cible du r\u00F4le oppos\u00E9must doivent \u00EAtre renseign\u00E9es.\n<li>Pour les associations navigables dans les deux sens \: la source du r\u00F4le courant doit \u00EAtre \u00E9gale \u00E0 la cible du r\u00F4le oppos\u00E9, de m\u00EAme que la cible du r\u00F4le courant doit \u00EAtre \u00E9gale \u00E0 la source du r\u00F4le oppos\u00E9.\n<li>Pour les associations non-navigables \: les sources des deux r\u00F4les doivent \u00EAtre renseign\u00E9s, mais pas leurs sources.</ul>
$E211.what=Le r\u00F4le ''{1}'' est invalide.
$E212.desc=Une ClassAssociation doit \u00EAtre reli\u00E9e \u00E0 une Class.
$E212.what=Une AssociationClass se trouvant sur l''Association ''{1}'' n''est pas reli\u00E9e \u00E0 une Class.
$E213.desc=Un ElementImport doit pointer vers un NameSpace.
$E213.what=Un lien d''import sur ''{1}'' ne pointe vers aucun namespace.
$E214.desc=Une Generalization doit \u00EAtre reli\u00E9e \u00E0 un NameSpace.
$E214.what=''{1}'' poss\u00E8de une Generalization sans destination.
$E215.desc=Une InterfaceRealization doit pointer vers une Interface.
$E215.what=Une InterfaceRealization de ''{1}'' ne pointe vers aucune Interface.
$E216.desc=Un Link doit poss\u00E9der au moins deux r\u00F4les instanci\u00E9s.
$E216.what=Le lien ''{0}'' ne poss\u00E8de pas le nombre minimum de r\u00F4les instanci\u00E9s.
$E217.desc=Un LinkEnd doit \u00EAtre reli\u00E9 \u00E0 un Link.
$E217.what=Le LinkEnd ''{0}'' n''est reli\u00E9 \u00E0 aucun lien.
$E218.desc=Un AnalystProject doit avoir un Dictionnaire racine.
$E218.what=Le projet Analyste ''{0}'' n''a pas de dictionnaire racine.
$E219.desc=Un AnalystProject doit avoir un conteneur d'exigences racine.
$E219.what=Le projet Analyste ''{0}'' n''a pas de conteneur d'exigences racine.
$E220.desc=Un AnalystProject doit avoir un conteneur d'objectifs racine.
$E220.what=Le projet Analyste ''{0}'' n''a pas de conteneur d'objectifs racine.
$E221.desc=Un AnalystProject doit avoir un conteneur de r\u00E8gles m\u00E9tier racine.
$E221.what=Le projet Analyste ''{0}'' n''a pas de conteneur de r\u00E8gles m\u00E9tier racine.
$E222.desc=Un AnalystProject doit avoir un conteneur de propri\u00E9t\u00E9s racine.
$E222.what=Le projet Analyste ''{0}'' n''a pas de conteneur de propri\u00E9t\u00E9s racine.
$E225.desc=Une Note doit avoir un NoteType.
$E225.what=''{1}'' poss\u00E8de une note sans type.
$E226.desc=Un PackageImport doit pointer vers un Package.
$E226.what=''{1}'' poss\u00E8de un lien d''import de package sans destination.
$E227.desc=Un PackageMerge doit pointer vers un Package.
$E227.what=Le package ''{1}'' poss\u00E8de un lien de fusion de package sans destination.
$E228.desc=Un Projet doit \u00EAtre reli\u00E9 \u00E0 un Package.
$E228.what=Le projet ''{0}'' n''a pas de package racine.
$E229.desc=Une Property doit avoir un PropertyType.
$E229.what=La Property ''{0}'' n''a pas de property type.
$E230.desc=Un PropertyTable doit avoir un PropertyTableDefinition.
$E230.what=Un property table de l''\u00E9l\u00E9ment ''{1}'' n''a pas de d\u00E9finition.
$E231.desc=Une RaisedException doit avoir un Classifier pour destination.
$E231.what=Une exception lev\u00E9e de l''\u00E9l\u00E9ment ''{1}'' ne poss\u00E8de aucune destination.
$E232.desc=Un Message doit pointer vers une MessageEnd.
$E232.what=Un message de l''\u00E9l\u00E9ment ''{1}'' ne pointe vers aucune extr\u00E9mit\u00E9 de message.
$E233.desc=Une StateMachine doit poss\u00E9der une Region racine.
$E233.what=Le StateMachine ''{0}'' ne poss\u00E8de pas de r\u00E9gion racine.
$E234.desc=Une TaggedValue doit avoir un type.
$E234.what=''{1}'' poss\u00E8de une tagged value sans type.
$E235.desc=Une UseCaseDependency doit pointer vers un UseCase.
$E235.what=Une UseCaseDependency de ''{1}'' ne pointe vers aucun cas d''utilisation.
$E236.desc=Une Manifestation doit pointer vers un ModelElement.
$E236.what=Une manifestation sur ''{1}'' ne pointe vers aucun \u00E9l\u00E9ment de mod\u00E8le.
$E237.desc=Un ExternDocument doit avoir au moins un ExternDocumentType.
$E237.what=Un ExternDocument appartenant \u00E0 l''\u00E9l\u00E9ment ''{1}'' n''a aucun ExternDocumentType.
$E238.desc=Un CombinedFragment doit avoir au moins une InteractionOperand.
$E238.what=Le CombinedFragment ''{0}'' doit avoir au moins une InteractionOperand.
$E239.desc=Une Constraint ne peut pas s'appliquer \u00E0 une Note.
$E239.what=La Constraint ''{0}'' ne peut pas s''appliquer \u00E0 la Note ''{1}''.
$E240.desc=La visibilit\u00E9 d'un ElementImport est Public ou Private.
$E240.what=Le lien d''import de ''{1}'' ({2}) vers ''{3}'' ({4}) ne peut pas \u00EAtre {5}.
$E241.desc=Une Manifestation ne peut se manifester elle-m\u00EAme.
$E241.what=Une manifestation de l'art\u00E9fact ''{1}'' ne doit pas s''utiliser elle m\u00EAme.
$E242.desc=Une Manifestation ne peut pas manifester son Artifact.
$E242.what=L''art\u00E9fact ''{1}'' ne doit pas se manifester lui-m\u00EAme.
$E243.desc=Un AssociationEnd peut appartenir \u00E0 une Classe, une Interface, un Component, un Acteur, un DataType, un Node ou un Signal.
$E243.what=Le r\u00F4le ''{0}'' ne peut pas appartenir \u00E0 l''\u00E9l\u00E9ment ''{1}'' {2}.
$E244.desc=La visibilit\u00E9 d'un PackageImport est publique ou priv\u00E9e.
$E244.what=Le package import qui se trouve entre ''{0}'' ({1}) et '2' ({3}) ne doit pas \u00EAtre {4}.
$E245.desc=Une BindableInstance ne peut pas appartenir \u00E0 la fois \u00E0 un Classifier, \u00E0 une Collaboration et \u00E0 une Instance.
$E245.what=La Part ''{0}'' ne peut appartenir qu''\u00E0 un seul des \u00E9l\u00E9ments suivants \: ''{1}''.
$E246.desc=Une Association peut lier un Acteur \u00E0 une Classe, une Interface, un Acteur, un UseCase ou un Component.
$E246.what=Le r\u00F4le ''{0}'' ne peut pas lier  {1} \u00E0 {2}.
$E247.desc=Un NameSpace ne peut s'importer lui-m\u00EAme.
$E247.what=L''espace de nommage ''{1}'' ({2}) ne doit pas poss\u00E8der un lien de type "Element Import" vers lui-m\u00EAme.
$E248.desc=Un lien Usage doit avoir une destination.
$E248.what=Un lien Usage de l''\u00E9l\u00E9ment ''{1}'' ({2}) n''a pas de destination.
$E249.desc=Un BindableInstance peut repr\u00E9senter un Attribute, un AssociationEnd ou une BindableInstance.
$E249.what=La part ''{0}'' ne peut pas repr\u00E9senter ''{1}'' {2}.
$E250.desc=Un Artifact stereotyp\u00E9 <<ModelComponentArchive>> ne peut pas manifester des \u00E9l\u00E9ments qui appartiennent \u00E0 un composant de mod\u00E8le d\u00E9ploy\u00E9.
$E250.what=L'Artifact ''{1}'' ne peut pas manifester l''\u00E9l\u00E9ment ''{2}'' car celui ci appartient \u00E0 un composant de mod\u00E8le d\u00E9ploy\u00E9.
$E251.desc=Un diagramme ne peut pas appartenir a un autre diagramme.
$E251.what=Le diagramme ''{0}'' ne doit pas appartenir \u00E0 {1}.
$E252.desc=Un Attribut peut \u00EAtre cr\u00E9\u00E9 dans une Class, un Actor, une Enumeration, une Interface, un DataType, un UseCase, un Component, un Node, un Role, un TemplateParameter.
$E252.what=L''Attribute ''{0}'' ne peut pas \u00EAtre cr\u00E9\u00E9 dans l''\u00E9l\u00E9ment ''{1}'' de type {2}.
$E253.desc=Une Collaboration appartient \u00E0 un NameSpace ou \u00E0 une Operation, mais ne peut pas appartenir aux deux en m\u00EAme temps.
$E253.what=La collaboration ''{0}'' ne peut pas appartenir \u00E0 un namespace et \u00E0 une op\u00E9ration en m\u00EAme temps.
$E254.desc=Un AcceptCallEventAction ne peut avoir aucun InputPin.
$E254.what=L''\u00E9l\u00E9ment ''{0}'' ne peut avoir aucun InputPin.
$E255.desc=Un AcceptChangeEventAction ne peut avoir aucun InputPin.
$E255.what=L''\u00E9l\u00E9ment ''{0}'' ne peut avoir aucun pin d'entr\u00E9e.
$E256.desc=Un AcceptSignalAction ne peut avoir aucun InputPin.
$E256.what=L''\u00E9l\u00E9ment ''{0}'' ne peut avoir aucun InputPin.
$E257.desc=Un AcceptTimeEventAction ne peut avoir aucun InputPin.
$E257.what=L''\u00E9l\u00E9ment ''{0}'' ne peut avoir aucun InputPin.
$E258.desc=Un ActivityGroup ne peut appartenir qu'\u00E0 une Activity ou un groupe au maximum.
$E258.what=Le groupe ''{0}'' doit appartenir \u00E0 une activit\u00E9 ou \u00E0 un groupe d''activit\u00E9s au maximum.
$E259.desc=Un ActivityNode ne peut appartenir qu'\u00E0 une Activity, un StructuredNode, un ActivityGroup ou une ConditionalClause au maximum.
$E259.what=Le ActivityNode ''{0}'' doit apparternir au maximum \u00E0 une Activity, un StructureNode, un ActivityGroup ou une ConditionalClause.
$E260.desc=Une Partition avec isDimension \= true ne peut \u00EAtre contenue dans une autre Partition.
$E260.what=La partition ''{0}'' a isDimension \= true et est contenue dans une autre partition.
$E261.desc=Un FinalNode ne peut avoir d'OutgoingEdge
$E261.what=Le FinalNode ''{0}'' ne peut avoir d''OutgoingEdge
$E262.desc=Un InitialNode ne peut avoir aucun flux entrant.
$E262.what=L''InitialNode ''{0}'' ne peut avoir aucun flux entrant.
$E263.desc=Une interaction peut \u00EAtre plac\u00E9 dans un Actor, une Class, une Collaboration, un Component, une Interface, un Node, une Operation, un Package ou un Use Case.
$E263.what=L''Interaction ''{0}'' ne peut pas \u00EAtre plac\u00E9e dans l''\u00E9l\u00E9ment ''{1}'' de type {2}.
$E264.desc=Une ExecutionSpecification doit commencer et terminer sur la m\u00EAme Lifeline.
$E264.what=L''ExecutionSpecification ''{0}'' ne doit pas commencer et terminer sur deux Lifelines diff\u00E9rentes.
$E265.desc=Un ConditionalNode ne doit pas poss\u00E9der directement un ActivityNode (contrairement aux autres StructuredActivityNodes tels que des LoopNodes).
$E265.what=Le ConditionalNodes ''{0}'' ne peut pas contenir d''ActivityNode.
$E266.desc=Une Partition ne peut avoir \u00E0 la fois des sous-Partitions et des Nodes.
$E266.what=La partition ''{0}'' a des sous-partitions et des enfants \u00E0 la fois.
$E267.desc=ExecutionSpecification.Start.LineNumber doit \u00EAtre inf\u00E9rieur \u00E0 ExecutionSpecification.Finish.LineNumber.
$E267.what=L''ExecutionSpecification ''{0}'' doit avoir Start.LineNumber < Finish.LineNumber.
$E268.desc=L'attribut LineNumber sur un InteractionFragment doit toujours >\= 1.
$E268.what=L''InteractionFragment ''{0}'' a un LineNumber \u00E9gal \u00E0 {1}, mais il doit \u00EAtre sup\u00E9rieur ou \u00E9gal \u00E0 1.
$E269.desc=Un message ne doit pas remonter dans le temps. Son ReceiveEvent.LineNumber doit \u00EAtre >\= SendEvent.LineNumber.
$E269.what=Le message ''{0}'' remonte dans le temps \: il d\u00E9bute \u00E0 {1} et fini \u00E0 {2}.
$E270.desc=Un ActivityEdge doit avoir une source et une destination.
$E270.what=L''ActivityEdge ''{0}'' n''a pas de source ou de destination.
$E271.desc=Un Message doit avoir un SendEvent et un ReceiveEvent.
$E271.what=Le message ''{0}'' n''a pas de SendEvent ou de ReceiveEvent.
$E272.desc=Un InformationFlow doit avoir une source et une destination.
$E272.what=L''InformationFlow ''{0}'' n''a pas de source ou pas de destination.
$E273.desc=Une ExecutionSpecification doit avoir une occurrence Start et une occurrence Finish.
$E273.what=L''ExecutionSpecification ''{0}'' n''a pas d''occurrence Start ou Finish.
$E274.desc=Un message de cr\u00E9ation doit \u00EAtre le premier de sa ligne de vie.
$E274.what=Il y a au moins un fragment avant le message de cr\u00E9ation ''{0}''.
$E275.desc=Un message de destruction doit \u00EAtre le dernier de sa ligne de vie. Il ne peut \u00EAtre suivi d'un fragment.
$E275.what=Il y a au moins un fragment apres le message de destruction ''{0}''.
$E276.desc=Un ActivityDiagram d'activit\u00E9 ne peut \u00EAtre d\u00E9fini que sur une Activity.
$E276.what=L''ActivityDiagram ''{0}'' est d\u00E9fini sur {1}, qui est un(e) {2}.
$E277.desc=Un SequenceDiagram ne peut \u00EAtre d\u00E9fini que sur une Interaction.
$E277.what=Le diagramme de s\u00E9quence ''{0}'' est d\u00E9fini sur {1}, qui est un(e) {2}.
$E278.desc=Un CommunicationDiagram ne peut \u00EAtre d\u00E9fini que sur une CommunicationInteraction.
$E278.what=Le CommunicationDiagram ''{0}'' est d\u00E9fini sur {1} qui est un(e) {2}.
$E279.desc=A StateDiagram ne peut \u00EAtre d\u00E9fini que sur une StateMachine.
$E279.what=Le StateDiagram ''{0}'' est d\u00E9fini sur {1}, qui est un(e) {2}.
$E280.desc=Un stereotype ne doit pas avoir de cycle sur sa relation "Parent".
$E280.what=Le Stereotype ''{0}'' fait partie d''un cycle sur sa relation "Parent" \: {2}
$E282.desc=Un ensemble de Dependencies ne doit pas constituer un graphe cyclique.
$E282.what=La Dependency ''{0}'' constitue un cycle avec d''autres Dependencies d\u00E9j\u00E0 existantes.
$E283.desc=Les relations Cluster, Owner, InternalOwner et OwnerTemplateParameter sont exclusives dans une Instance.
$E283.what=L''instance ''{0}'' a plusieurs propri\u00E9taires. Elle ne peut en avoir qu''un seul.
$E284.desc=Une ExecutionSpecification, une ExecutionOccurrenceSpecification ou un StateInvariant doit couvrir exactement une Lifeline.
$E284.what=L''InteractionFragment ''{0}'' couvre {1} lignes de vie.
$E286.desc=InteractionOperand.EndLineNumber doit \u00EAtre >\= \u00E0 tous les InteractionOperand.Fragment.getLastLine().
$E286.what=L''InteractionOperand ''{0}'' doit avoir getLastLine() >\= getFirstLine() pour tous ses fragments.
$E287.desc=InteractionFragment.getLastLine() doit toujours \u00EAtre >\= \u00E0 InteractionFragment.getFirstLine().
$E287.what=FirstLine et LastLine incorrect pour l''InteractionFragment ''{0}'' \: {1} >\= {2}
$E288.desc=Une Gate sur un InteractionUse doit satisfaire ces in\u00E9galit\u00E9s \:\nGate.OwnerUse.getFirstLine() < Gate.getFirstLine() < Gate.OwnerUse.getLastLine()
$E288.what=FirstLine ou LastLine incorrect pour le Gate ''{0}'' sur l''InteractionUse ''{1}'' \: {2}  <  {3}  <  {4}.
$E289.desc=Un Gate sur un CombinedFragment doit satisfaire ces in\u00E9galit\u00E9s \:\nGate.OwnerFragment.getFirstLine() < Gate.getFirstLine() < Gate.OwnerFragment.getLastLine()
$E289.what=FirstLine ou LastLine incorrect pour le Gate ''{0}'' sur le CombinedFragment ''{1}'' \: {2}  <  {3}  <  {4}.
$E290.desc=Si les MessageEnds \u00E9metteur et receveur sont situ\u00E9s sur la m\u00EAme Lifeline, alors le MessageEnd \u00E9metteur doit avoir un LineNumber inf\u00E9rieur ou \u00E9gal \u00E0 celui du MessageEnd receveur.
$E290.what=Le message ''{0}'' doit avoir SendEvent.LineNumber <\= \u00E0 ReceiveEvent.LineNumber mais {1} <\= {2}.
$E291.desc=Les \u00E9l\u00E9ments Analyst doivent \u00EAtre du m\u00EAme type que leur parent.
$E291.what=Le type de l''\u00E9l\u00E9ment ''{0}'' est incompatible avec celui de son parent.
$E292.desc=Un AnalystItems doit avoir une AnalystPropertyTable.
$E292.what=''{0}'' n''a pas d'AnalystPropertyTable.
$E293.desc=Une AssociationEnd doit avoir un r\u00F4le oppos\u00E9.
$E293.what=L''AssociationEnd ''{1}''  n''a pas de r\u00F4le oppos\u00E9.
$E294.desc=Un st\u00E9r\u00E9otype ne peut \u00EAtre appliqu\u00E9 que sur un \u00E9l\u00E9ment compatible.
$E294.what=Le st\u00E9r\u00E9otype ''{0}'' ne peut \u00EAtre appliqu\u00E9 sur l''\u00E9l\u00E9ment ''{1}'' qui est incompatible.
$E295.desc=An AssociationEnd must have an Association.
$E295.what=The ''{0}'' AssociationEnd must have a related Association.
$E296.desc=A LinkEnd must have a Link.
$E296.what=The ''{0}'' LinkEnd must have a related Link.
$E297.desc=Un st\u00E9r\u00E9otype abstrait peut ne pas \u00EAtre applicable \u00E0 n''importe quel \u00E9l\u00E9ment.
$E297.what=Le st\u00E9r\u00E9otype abstrait ''{1}'' est appliqu\u00E9 \u00E0 l''\u00E9l\u00E9ment ''{0}''.
$R111.desc=Le st\u00E9r\u00E9otype d'un \u00E9l\u00E9ment doit \u00EAtre compatible avec la m\u00E9taclasse de l'\u00E9l\u00E9ment.
$R111.what=Le st\u00E9r\u00E9otype ''{2}'' ne peut \u00EAtre appliqu\u00E9 \u00E0 un \u00E9l\u00E9ment de type ''{1}''.
$R113b.desc=Le nom du namespace use ne doit pas entrer en conflit avec un type pr\u00E9d\u00E9fini.
$R113b.what=Le nom de ''{0}'' ({1}) entre en conflit avec le type pr\u00E9d\u00E9fini ''{2}''.
$R142.desc=Un package ne peut appartenir qu'\u00E0 un Package, un Component, un Projet, ou un TemplateParameter.
$R142.what=Le package ''{1}'' ne peut appartenir \u00E0 un {0}.
$R153.desc=Le type d'un Parameter doit \u00EAtre une Class, une Interface, un DataType, ou une Enumeration.
$R153.what=Le Parameter ''{0}'' ne peut \u00EAtre typ\u00E9 par l''\u00E9l\u00E9ment ''{1}'' {2}.
$R158.desc=Un Signal doit appartenir \u00E0 une Class, un Package, un TemplateParameter, ou un Component.
$R158.what=Le Signal ''{0}'' ne peut pas appartenir \u00E0 un \u00E9l\u00E9ment de type {1}.
$R188.desc=Un \u00E9l\u00E9ment ne peut appartenir \u00E0 lui-m\u00EAme.
$R188.what=L'\u00E9l\u00E9ment ''{0}'' {1} ne peut appartenir \u00E0 lui-m\u00EAme.
$R192.desc=Une Collaboration doit appartenir \u00E0 un Package, une Class, un Component, une Interface, un UseCase, un Signal, un Actor, une Operation, ou un TemplateParameter.
$R192.what=La Collaboration ''{0}''ne peut pas appartenir \u00E0 {1}.
$R194.desc=Le type d'une note doit \u00EAtre compatible avec l'\u00E9l\u00E9ment annot\u00E9.
$R194.what=Le type de la note ''{2}'' ne peut pas \u00EAtre appliqu\u00E9 \u00E0 un \u00E9l\u00E9ment de type {1}.
$R197.desc=Le type d'une TaggedValue doit \u00EAtre compatible avec l'\u00E9l\u00E9ment annot\u00E9.
$R197.what=Le type de la TaggedValue ''{2}'' ne peut pas \u00EAtre appliqu\u00E9 \u00E0 un \u00E9l\u00E9ment de type {1}.
$R207.desc=Un Actor ne peut appartenir qu'\u00E0 un Package, une Class, un Component, ou une Interface.
$R207.what=L''Actor ''{0}'' ne peut appartenir \u00E0 l''\u00E9l\u00E9ment ''{1}'' ({2}).
$R221-20.desc=Une PropertyValue doit avoir une Property.
$R221-20.what=Une property value appartenant \u00E0  l''\u00E9l\u00E9ment ''{2}'' n''a pas de Property.
$R221-28.desc=Une TemplateParameterSubstitution doit r\u00E9f\u00E9rencer un TemplateParameter.
$R221-28.what=Une template tarameter substitution appartenant \u00E0 l''\u00E9l\u00E9ment ''{2}'' ne r\u00E9f\u00E9rence aucun template parameter.
$R233.desc=Une Operation ne peut lever d'exception que de type Class, Interface, Enumeration, ou DataType type exceptions.
$R233.what=L''Operation ''{0}'' ne peut lever l''exception ''{2}'' ({3}).
$R236.desc=Si la relation 'Owner' d'une BindableInstance a \u00E9t\u00E9 d\u00E9finie, elle ne peut pointer que vers une Collaboration.
$R236.what=La part ''{0}'' ne peut pas appartenir \u00E0 l''\u00E9l\u00E9ment {2} ''{1}''.
$R250.desc=Une CollaborationUse ne peut appartenir qu'\u00E0 un \u00E9l\u00E9ment de l'un des types suivants \: Class, Actor, UseCase, Signal, Node, Collaboration, ou Component.
$R250.what=L''\u00E9l\u00E9ment ''{0}'' {1} ne peut appartenir \u00E0 l''\u00E9l\u00E9ment {3} ''{2}''.
$R254.desc=Un Artifact doit appartenir \u00E0 un Package, un Component, un Artifact, ou un TemplateParameter.
$R254.what=L''Artifact ''{1}'' doit appartenir \u00E0 un \u00E9l\u00E9ment {0}.
$R255.desc=Un Node doit appartenir \u00E0 un Package, un Component, un Noden ou un TemplateParameter.
$R255.what=Le Node ''{1}'' doit appartenir \u00E0 un \u00E9l\u00E9ment {0}.
$R277.desc=Un ConnectorEnd peut repr\u00E9senter un Attribute, une AssociationEnd ou une LinkEnd.
$R277.what=Le connector ''{0}'' ne peut pas repr\u00E9senter l''\u00E9l\u00E9ment {2} ''{1}''.
$R278.desc=Un Connector peut repr\u00E9senter un Attribute, une Association, ou un Link.
$R278.what=Le lien connector ''{0}'' ne peut pas repr\u00E9senter l''\u00E9l\u00E9ment {2} ''{1}''.
$R280.desc=Une BindableInstance ne peut pas appartenir \u00E0 une Interface.
$R280.what=La part ''{0}'' ne peut pas appartenir \u00E0 l''\u00E9l\u00E9ment {2} ''{1}''.
$R282.desc=Un TemplateParameter doit \u00EAtre li\u00E9 \u00E0 son NameSpace par une relation de type Parameterized et non par une relation de type Owner.
$R282.what=Le template parameter ''{0}'' ne peut pas \u00EAtre li\u00E9 \u00E0 ''{1}'' par une relation de type Owner.
$R283.desc=Les modules d\u00E9ploy\u00E9s doivent tous avoir des noms diff\u00E9rents..
$R283.what=Le projet contient {0} modules nomm\u00E9s ''{1}''.
$R284.desc=Un Component doit appartenir \u00E0 une Class, un Package, un TemplateParameter, ou un Component.
$R284.what=Le Component ''{0}'' ne peut pas appartenir \u00E0 {1}.
$R288.desc=Une Interface doit apartenir \u00E0 un Package, un Component, une Class, ou une Interface.
$R288.what=L''Interface ''{1}'' doit appartenir \u00E0 un \u00E9l\u00E9ment de type {0}.
$R289.desc=Un TemplateParameter doit appartenir \u00E0 un Package, une Collaboration, un Component, un Node,  un UseCase, un Signal, une Class, une Interface, une Enumeration, un DataType, ou un Artifact.
$R289.what=Le TemplateParameter ''{1}'' doit appartenir \u00E0 un \u00E9l\u00E9ment de type {0}.
$R291.desc=Un TemplateBinding doit appartenir \u00E0 un Package, une Collaboration, un Component, un Node, un UseCase, un Signal, une Class, une Interface, une Enumeration, un DataType, ou un Artifact.
$R291.what=Le TemplateBinding ''{1}'' doit appartenir \u00E0 un \u00E9l\u00E9ment de type {0}.
$R38.desc=Un Attribute peut \u00EAtre typ\u00E9 par une Class, une Interface, un DataType, ou un type primitif.
$R38.what=L''attribute ''{0}'' ne peut pas \u00EAtre typ\u00E9 par ''{1}'' ({2}).
$R44.desc=Une Class doit appartenir \u00E0 une Class, une Interface, un Package, un TemplateParameter, ou un Component.
$R44.what=La class ''{0}'' ne peut pas appartenir \u00E0 un \u00E9l\u00E9ment de type {1}.
$R61017.desc=Dans un groupe, ni les sous-groupes ni les groupes parents ne peuvent contenir des crossing nodes ou des flux.
$R61017.what=L''\u00E9l\u00E9ment ''{0}'' est contenu \u00E0 la fois dans ''{1}'' et son sous-groupe ''{2}''.
$R69.desc=Un DataType doit appartenir \u00E0 un Package, un Component, une Class, une Enumeration, une Interface, ou un Signal.
$R69.what=The ''{0}'' datatype cannot belong to the ''{1}'' {2}.
$R70001.desc=Il ne peut y avoir qu'un seul et unique module nomm\u00E9 LocalModule dans un projet.
$R70001.what=Le projet ne peut contenir qu'un module nomm\u00E9 LocalModule.
$R70003.desc=Les diff\u00E9rents domaines Analyst ne peuvent pas \u00EAtre m\u00E9lang\u00E9s.\nUn \u00E9l\u00E9ment du domaine Requirement ne peut appartenir qu'\u00E0 un Requirement Container, un \u00E9l\u00E9ment du domaine Goal ne peut appartenir qu'\u00E0 un Goal Container, un \u00E9l\u00E9ment du domaine Business Rules ne peut appartenir qu'\u00E0 un Business Rules Container, et un \u00E9l\u00E9ment du domaine Dictionary domain ne peut appartenir qu'\u00E0 un Dictionary.
$R70003.what=L''\u00E9l\u00E9ment Analyst ''{0}'' a \u00E9t\u00E9 d\u00E9plac\u00E9 dans le container ''{1}'' qui est d'un domaine Analyst diff\u00E9rent.
$R70005.desc=Il ne doit pas y avoir de cycle dans un graphique de composition.
$R70005.what=Un cycle a \u00E9t\u00E9 d\u00E9t\u00E9ct\u00E9 dans le graphique de composition de ''{0}''.
$R72.desc=Une Enumeration doit appartenir \u00E0 un Package, une Class, un Component, une Interface, un TemplateParameter, une Enumeration, ou un Signal.
$R72.what=L''Enumeration ''{0}'' ne peut pas appartenir \u00E0 un \u00E9l\u00E9ment de type {1}.
$R9000.desc=Une relation partant d'un \u00E9l\u00E9ment ne peut pas r\u00E9f\u00E9rencer un autre \u00E9l\u00E9ment plusieurs fois.
$R9000.what=L''\u00E9l\u00E9ment ''{0}'' de type {1} r\u00E9f\u00E9rence plusieurs fois l''\u00E9l\u00E9ment ''{2}'' de type {3} via la relation ''{4}''.
$R99.desc=Une Interface ne peut \u00EAtre impl\u00E9ment\u00E9e que par une Class, une Enumeration, ou un Component.
$R99.what=L''Interface ''{0}'' ne peut pas \u00EAtre impl\u00E9ment\u00E9e par l'\u00E9l\u00E9ment ''{2}'' de type {3}.

AccessWorkspaceAccessDenied.failed.message=L''espace de travail ''{0}'' existe mais n''est pas accessible.Veuillez v\u00E9rifier que vous disposez des autorisations n\u00E9cessaires ou changez d''espace de travail.
AccessWorkspaceAccessDenied.failed.title=Espace de travail non accessible
AccessWorkspaceWrite.failed.message=L''espace de travail ''{0}'' est verruoill\u00E9 en \u00E9criture.\nLe r\u00E9pertoire de l''espace de travail doit \u00EAtre accessible en \u00E9criture afin de pouvoir cr\u00E9er et g\u00E9rer les projets Modelio.\nVeuillez corriger ses permissions ou changer d''espace de travail pour un r\u00E9pertoire accessible.
AccessWorkspaceWrite.failed.title=Impossible d'acc\u00E9der \u00E0 l'espace de travail.

CannotImportExistingProjectMsg=Le projet ''{0}'' existe d\u00E9j\u00E0 dans le workspace courant.\nVoulez-vous l''\u00E9craser et le remplacer par le projet import\u00E9 ?
CannotImportExistingProjectTitle=un projet du m\u00EAme nom existe d\u00E9j\u00E0
CommandlineData.ArgNeedParameter=L''argument de ligne de commande ''{1}'' n\u00E9cessite {2} param\u00E8tres.
ConfirmMigrationDialog.button.abort=Annuler
ConfirmMigrationDialog.button.abort.tooltip=Annuler l''ouverture du projet
ConfirmMigrationDialog.button.no=Non
ConfirmMigrationDialog.button.no_all=Non pour tous
ConfirmMigrationDialog.button.yes=Oui
ConfirmMigrationDialog.button.yes_all=Oui pour tous
ConfirmMigrationDialog.conclusion.msg=Vous pouvez choisir de migrer ou non le mod\u00E8le maintenant. Si le mod\u00E8le n''est pas migr\u00E9, il ne sera pas accessible.\nSouhaitez-vous migrer le mod\u00E8le maintenant ?
ConfirmMigrationDialog.detailarea.title=D\u00E9tails
ConfirmMigrationDialog.details={3}\r\n\r\nLe mod\u00E8le de travail ''{0}'' va \u00EAtre migr\u00E9 \:\r\n   de\:   {1}\r\n   vers\: {2}\r\n
ConfirmMigrationDialog.diff.future=The ''{0} v{1}'' metamodel comes from a newer Modelio than the current ''{0}'' metamodel ({2}). \nGet the latest version of Modelio to open it.
ConfirmMigrationDialog.diff.missing=Le m\u00E9tamod\u00E8le ''{0} v{1}'' est manquant.
ConfirmMigrationDialog.diff.older=Le m\u00E9tamod\u00E8le ''{0} v{1}''  n''est pas \u00E0 jour par rapport \u00E0 la version v{2}.
ConfirmMigrationDialog.diff.older.compat=Le m\u00E9tamod\u00E8le ''{0} v{1}''  n''est pas \u00E0 jour par rapport \u00E0 la version v{2}.
ConfirmMigrationDialog.header=Le mod\u00E8le de travail ''{0}'' doit \u00EAtre migr\u00E9.
ConfirmMigrationDialog.required.title=Important
ConfirmMigrationDialog.title=Migration n\u00E9cessaire
CoreAudit.report.close=Fermer
CoreAudit.report.message=L'op\u00E9ration en cours pourrait rendre le mod\u00E8le incoh\u00E9rent pour les raisons d\u00E9taill\u00E9es ci-dessous.\nL'op\u00E9ration a donc \u00E9t\u00E9 annul\u00E9e pour pr\u00E9server le mod\u00E8le.
CoreAudit.report.title=Alerte Model Shield
CreateProject.ProgressDialog.title=Cr\u00E9ation de projet en cours...

FragmentsMigrator.ask.denied=The ''{0}'' work model is managed by Modelio Server and may not be migrated with this edition of Modelio.\nUse a commercial edition of Modelio with a Modelio server client license to migrate it.
FragmentsMigrator.ask.error=An unexpected {0} occurred while asking for migration of ''{1}''
FragmentsMigrator.displayMigrationResult.failed.message=La migration de {1} des {0} mod\u00E8les a \u00E9chou\u00E9.  Voir "d\u00E9tails" pour plus d''informations.
FragmentsMigrator.displayMigrationResult.success.message=La migration des {0} mod\u00E8les a r\u00E9ussi. Voir "d\u00E9tails" pour plus d''informations.
FragmentsMigrator.displayMigrationResult.title=R\u00E9sultat de la migration du mod\u00E8le
FragmentsMigrator.migrateFragment.abort=L''ouverture du projet a \u00E9t\u00E9 annul\u00E9e avant la migration du mod\u00E8le ''{0}''.
FragmentsMigrator.migrateFragment.cancel=La migration des ''{0}'' mod\u00E8les a \u00E9t\u00E9 annul\u00E9e.
FragmentsMigrator.migrateFragment.failed=La migration du mod\u00E8le ''{0}'' a \u00E9chou\u00E9.
FragmentsMigrator.migrateFragment.skip=La migration du mod\u00E8le ''{0}'' a \u00E9t\u00E9 ignor\u00E9e.
FragmentsMigrator.migrateFragment.success=Migration du mod\u00E8le ''{0}'' termin\u00E9e.
FragmentsMigrator.monitor.begin=Migration {0, choice,0\#nothing|1\#du mod\u00E8le|2\#de {0} mod\u00E8les}...

ImportingProject=Import de projet en cours...
InvalidProjectArchiveMsg=Le fichier ''{0}'' n''est pas un fichier d''export de projet valide.\r\nVeuillez s\u00E9lectionner un autre fichier.
InvalidProjectArchiveTitle=Fichier de projet export\u00E9 invalide

ModelerModuleMissing.Message=Le module 'Modeler Module' est manquant.\nVeuillez l'ajouter au catalogue de modules et r\u00E9essayer.

OpenProjectHandler.Auth.FragmentLabel=mod\u00E8le {0}
OpenProjectHandler.Auth.ModuleLabel=module {0}
OpenProjectHandler.Auth.ProjectLabel=projet {0}
OpenProjectService.version.MigrationNeeded=Le projet ''{0}'' est issu de Modelio {1}.\nIl doit \u00EAtre migr\u00E9 \u00E0 la version {2}.
OpenProjectService.version.dialog.possible.message={3}\r\n\r\nSi vous continuez le projet sera migr\u00E9 et deviendra un projet Modelio {2}, ce qui signifie qu''il ne sera plus lisible par Modelio {1}.\r\n\r\nSouhaitez-vous continuer ? 
OpenProjectService.version.dialog.possible.title=Migration vers Modelio {2} n\u00E9cessaire.
OpenProjectService.version.future=Le projet ''{0}'' n\u00E9cessite Modelio {1} et ne peut pas \u00EAtre ouvert par Modelio {2} qui est plus ancien.\r\nVous avez l''option de mettre \u00E0 jour Modelio vers la version {1} pour ouvrir le projet. \r\nR\u00E9f\u00E9rez-vous \u00E0 la documentation Modelio ou contactez le support Modelio \: support-modelio@softeam.com
OpenProjectService.version.none=La version de Modelio requise par le projet ''{0}'' n''a pas pu \u00EAtre d\u00E9termin\u00E9e, son ouverture n''est par cons\u00E9quent pas possible.\r\nCe projet est probablement trop ancien ou son contenu d\u00E9terior\u00E9.\r\nVeuillez contacter le support Modelio \: support-modelio@softeam.com
OpenProjectService.version.v1=Le projet ''{0}'' provient de Modelio {1}.\r\nIl doit donc d''abord \u00EAtre migr\u00E9 vers Modelio 2 puis export\u00E9 depuis Modelio 2.\r\nR\u00E9f\u00E9rez-vous \u00E0 la documentation Modelio ou contactez le support Modelio \: support-modelio@softeam.com 
OpenProjectService.version.v2=Le projet ''{0}'' provient de Modelio {1}.\r\nPar cons\u00E9quent, il doit d''abord \u00EAtre export\u00E9 depuis Modelio 2 \u00E0 l''aide du module de migration Modelio 3.\r\nR\u00E9f\u00E9rez-vous \u00E0 la documentation Modelio ou contactez le support Modelio \: support-modelio@softeam.com 

ProjectName.InvalidCharacters=Le nom contient des caract\u00E8res invalides.
ProjectName.NameAlreadyUsed=Ce nom est d\u00E9j\u00E0 utilis\u00E9.
ProjectService.ProjectSynchroFailed.message=La synchronisation du projet {0} a \u00E9chou\u00E9 \:\n\n{1}\n\nVous pouvez travailler dessus mais sa composition peut \u00EAtre obsol\u00E8te.
ProjectService.ProjectSynchroFailed.title=La synchronisation du projet a \u00E9chou\u00E9
ProjectService.ProjectSynchroProblems.message=Des probl\u00E8mes sont survenus durant la synchronisation du projet ''{0}'' depuis le serveur \:\n\n
ProjectService.ProjectSynchroProblems.title=Probl\u00E8mes de synchronisation du projet
ProjectService.fragmentDown=Le fragment ''{0}'' est hors-service.\nVeuillez corriger la source du probl\u00E8me et r\u00E9essayer.
ProjectService.noEventMessage=<aucun message>
ProjectService.open.phase1=Lecture de la configuration du projet...
ProjectService.open.phase2=Mise \u00E0 jour de la configuration du projet...
ProjectService.open.phase3=Chargement des mod\u00E8les...
ProjectService.open.phase4=Migration des mod\u00E8les...
ProjectService.open.phase5=D\u00E9marrage des modules...
ProjectService.open.phase6=Ouverture...
ProjectService.open.task=Ouverture du projet ''{0}''...
ProjectService.save.task=Sauvegarde du projet ''{0}''...
ProjectSynchro.installModule=Installation du module ''{0}'' v{1} depuis ''{2}''...
ProjectSynchro.removeModule=D\u00E9sinstallation du module ''{0}'' v{1} ...
ProjectSynchro.updateModule=Mise \u00E0 jour du module ''{0}'' v{1} vers v{2}...

with=the following steps\:
