$R3140.description=Un Sequence Flow sortant doit avoir une garde nulle.
$R3090.description=Un Sequence Flow ne peut avoir sa source et sa destination dans des Process diff\u00E9rrents.
$R3110.message=Le Sequence Flow ''{0}'' cible un Start Event ou vient d''un End Event.
$R3080.message=Le Flow Node ''{0}'' fait partie d''une s\u00E9quence qui ne commence pas par un Start Event ou ne finit pas par un End Event.
$R3160.message=Le Message Flow ''{0}'' a une Gateway comme source ou comme cible.
$R3100.description=Un Sequence Flow ne peut avoir sa source et sa destination dans des Sub-Process diff\u00E9rrents.
$R3240.message=L''\u00E9l\u00E9ment ''{1}'' de type {0} contient plus d''une s\u00E9quence.
$R3320.message=Le MessageFlow ''{0}'' a une origine ou une destination invalide.
$R3290.message=Un SequenceFlow est \u00E9cessaire pour supporter le transfert du Data Object ''{0}'' entre ''{1}'' et ''{2}''.
$R3220.description=Un Sequence Flow sortant d'un Event Based Gateway doit cibler un Intermediate Catch Event.
$R3170.description=Une Gateway, \u00E0 l'exception des Parallel Gateways, doit avoir au moins deux Sequence Flows sortants.
$R3290.description=Un SequenceFlow est \u00E9cessaire pour les DataAssociations.
$R3120.message=Le Link Event ''{0}'' doit \u00EAtre reli\u00E9 \u00E0 un autre Link Event.
$R3200.message=Le Link Event ''{0}'' doit avoir le m\u00EAme nom que le Link Event auquel il est reli\u00E9.
$R3090.message=Le Sequence Flow ''{0}'' a sa source et sa destination dans des Process diff\u00E9rrents.
$R3170.message=La Gateway ''{0}'' a moins de deux Sequence Flow sortants.
$R3130.description=Un Message Flow ne peut cibler un End Event ou un Intermediate Throw Event, ni venir d'un Start Event ou d'un Intermediate Catch Event.
$R3080.description=Tout les Flow Nodes doivent faire partie d'une s\u00E9quence commen\u00E7ant par un Start Event et finissant par un End Event.
$R3250.message=L''\u00E9l\u00E9ment ''{1}'' de type {0} n''a pas de Start Event ou de End Event.
$R3250.description=Un Process ou un Sub-Process doivent avoir au moins un Start Event et un End Event.
$AuditCategory.BPMN.label=BPMN
$R3160.description=Un Message Flow ne peut avoir une Gateway comme source ou comme cible.
$R3130.message=Le Message Flow ''{0}'' cible un End Event ou un Intermediate Throw Event, ou vient d''un Start Event ou d''un Intermediate Catch Event.
$R3180.message=L''\u00E9l\u00E9ment ''{1}'' de type {0} a un {1} vers lui-m\u00EAme.
$R3120.description=Un Link Event doit \u00EAtre reli\u00E9 \u00E0 un autre Link Event.
$R3280.description=Un FlowElement doit appartenir \u00E0 une Lane.
$R3240.description=Il ne peut y avoir qu'une seule s\u00E9quence dans un Process ou un Sub-Process.
$R3190.description=Un Data Association ne peut avoir un Data Output comme source et ne peut cibler un Data Input.
$R3140.message=L''\u00E9l\u00E9ment ''{1}'' de type {0} a un Sequence Flow sortant avec sa propri\u00E9t\u00E9 "Garde" non nulle.
$R3220.message=Le Sequence Flow ''{0}'' a un Event Based Gateway comme source mais ne cible pas un Intermediate Catch Event.
$R3190.message=Le Data Association ''{0}'' a un Data Output comme source ou cible un Data Input.
$R3270.message=Le State ''{1}'' r\u00E9f\u00E9renc\u00E9 par le BpmnItemAwareElement ''{0}'' doit faire parti de la hi\u00E9rarchie de composition de ''{2}''.
$R3200.description=Un Link Event doit avoir le m\u00EAme nom que le Link Event auquel il est reli\u00E9.
$R3150.description=Un Message Flow ne peut lier deux \u00E9l\u00E9ments d'un m\u00EAme Process.
$R3320.description=Un MessageFlow doit partir d'un SendTask/ThrowEvent/Participant et arriver sur un ReceiveTask/CatchEvent/Participant.
$R3270.description=Le State d'un BpmnItemAwareElement doit appartenir \u00E0 la GeneralClass qu'il repr\u00E9sente.
$R3110.description=Un Sequence Flow ne peut pas cibl\u00E9 un Start Event ou venir d'un End Event.
$R3100.message=Le Sequence Flow ''{0}'' a sa source et sa destination dans des Sub-Process diff\u00E9rents.
$R3150.message=Le Message Flow ''{0}'' relie deux \u00E9l\u00E9ments d''un m\u00EAme Process.
$R3230.message=L''Exclusive Gateway ''{0}'' a un Sequence Flow sortant qui n''est pas celui par d\u00E9faut et qui n''a pas de garde.
$R3230.description=Tous les Sequence Flows sortant d'une Exclusive Gateway doivent avoir une garde sauf pour celui par d\u00E9faut.
$R3280.message=L''\u00E9l\u00E9ment ''{1}'' de type {0} doit faire parti d''une Lane dans le Process ''{2}''.
$R3180.description=Un Flow Element (et respectivement un Base Element) ne peut avoir un Sequence Flow (respectivement un Message Flow) vers lui-m\u00EAme.
